bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21n/include_mcc/pio/samc21n17a.h
#define PIN_PA05B_AC_AIN1                          (5L)         
#define MUX_PA05B_AC_AIN1                          (1L)        
#define PINMUX_PA05B_AC_AIN1                       ((PIN_PA05B_AC_AIN1 << 16) | MUX_PA05B_AC_AIN1)
#define PORT_PA05B_AC_AIN1                         ((1UL) << 5)

#define PIN_PA06B_AC_AIN2                          (6L)         
#define MUX_PA06B_AC_AIN2                          (1L)        
#define PINMUX_PA06B_AC_AIN2                       ((PIN_PA06B_AC_AIN2 << 16) | MUX_PA06B_AC_AIN2)
#define PORT_PA06B_AC_AIN2                         ((1UL) << 6)

#define PIN_PA07B_AC_AIN3                          (7L)         
#define MUX_PA07B_AC_AIN3                          (1L)        
#define PINMUX_PA07B_AC_AIN3                       ((PIN_PA07B_AC_AIN3 << 16) | MUX_PA07B_AC_AIN3)
#define PORT_PA07B_AC_AIN3                         ((1UL) << 7)

#define PIN_PA02B_AC_AIN4                          (2L)         
#define MUX_PA02B_AC_AIN4                          (1L)        
#define PINMUX_PA02B_AC_AIN4                       ((PIN_PA02B_AC_AIN4 << 16) | MUX_PA02B_AC_AIN4)
#define PORT_PA02B_AC_AIN4                         ((1UL) << 2)

#define PIN_PB04B_AC_AIN5                          (36L)        
#define MUX_PB04B_AC_AIN5                          (1L)        
#define PINMUX_PB04B_AC_AIN5                       ((PIN_PB04B_AC_AIN5 << 16) | MUX_PB04B_AC_AIN5)
#define PORT_PB04B_AC_AIN5                         ((1UL) << 4)

#define PIN_PB05B_AC_AIN6                          (37L)        
#define MUX_PB05B_AC_AIN6                          (1L)        
#define PINMUX_PB05B_AC_AIN6                       ((PIN_PB05B_AC_AIN6 << 16) | MUX_PB05B_AC_AIN6)
#define PORT_PB05B_AC_AIN6                         ((1UL) << 5)

#define PIN_PB06B_AC_AIN7                          (38L)        
#define MUX_PB06B_AC_AIN7                          (1L)        
#define PINMUX_PB06B_AC_AIN7                       ((PIN_PB06B_AC_AIN7 << 16) | MUX_PB06B_AC_AIN7)
#define PORT_PB06B_AC_AIN7                         ((1UL) << 6)

#define PIN_PA12H_AC_CMP0                          (12L)        
#define MUX_PA12H_AC_CMP0                          (7L)        
#define PINMUX_PA12H_AC_CMP0                       ((PIN_PA12H_AC_CMP0 << 16) | MUX_PA12H_AC_CMP0)
#define PORT_PA12H_AC_CMP0                         ((1UL) << 12)

#define PIN_PA18H_AC_CMP0                          (18L)        
#define MUX_PA18H_AC_CMP0                          (7L)        
#define PINMUX_PA18H_AC_CMP0                       ((PIN_PA18H_AC_CMP0 << 16) | MUX_PA18H_AC_CMP0)
#define PORT_PA18H_AC_CMP0                         ((1UL) << 18)

#define PIN_PB24H_AC_CMP0                          (56L)        
#define MUX_PB24H_AC_CMP0                          (7L)        
#define PINMUX_PB24H_AC_CMP0                       ((PIN_PB24H_AC_CMP0 << 16) | MUX_PB24H_AC_CMP0)
#define PORT_PB24H_AC_CMP0                         ((1UL) << 24)

#define PIN_PA13H_AC_CMP1                          (13L)        
#define MUX_PA13H_AC_CMP1                          (7L)        
#define PINMUX_PA13H_AC_CMP1                       ((PIN_PA13H_AC_CMP1 << 16) | MUX_PA13H_AC_CMP1)
#define PORT_PA13H_AC_CMP1                         ((1UL) << 13)

#define PIN_PA19H_AC_CMP1                          (19L)        
#define MUX_PA19H_AC_CMP1                          (7L)        
#define PINMUX_PA19H_AC_CMP1                       ((PIN_PA19H_AC_CMP1 << 16) | MUX_PA19H_AC_CMP1)
#define PORT_PA19H_AC_CMP1                         ((1UL) << 19)

#define PIN_PB25H_AC_CMP1                          (57L)        
#define MUX_PB25H_AC_CMP1                          (7L)        
#define PINMUX_PB25H_AC_CMP1                       ((PIN_PB25H_AC_CMP1 << 16) | MUX_PB25H_AC_CMP1)
#define PORT_PB25H_AC_CMP1                         ((1UL) << 25)

#define PIN_PA00H_AC_CMP2                          (0L)         
#define MUX_PA00H_AC_CMP2                          (7L)        
#define PINMUX_PA00H_AC_CMP2                       ((PIN_PA00H_AC_CMP2 << 16) | MUX_PA00H_AC_CMP2)
#define PORT_PA00H_AC_CMP2                         ((1UL) << 0)

#define PIN_PA24H_AC_CMP2                          (24L)        
#define MUX_PA24H_AC_CMP2                          (7L)        
#define PINMUX_PA24H_AC_CMP2                       ((PIN_PA24H_AC_CMP2 << 16) | MUX_PA24H_AC_CMP2)
#define PORT_PA24H_AC_CMP2                         ((1UL) << 24)

#define PIN_PB30H_AC_CMP2                          (62L)        
#define MUX_PB30H_AC_CMP2                          (7L)        
#define PINMUX_PB30H_AC_CMP2                       ((PIN_PB30H_AC_CMP2 << 16) | MUX_PB30H_AC_CMP2)
#define PORT_PB30H_AC_CMP2                         ((1UL) << 30)

#define PIN_PA01H_AC_CMP3                          (1L)         
#define MUX_PA01H_AC_CMP3                          (7L)        
#define PINMUX_PA01H_AC_CMP3                       ((PIN_PA01H_AC_CMP3 << 16) | MUX_PA01H_AC_CMP3)
#define PORT_PA01H_AC_CMP3                         ((1UL) << 1)

#define PIN_PA25H_AC_CMP3                          (25L)        
#define MUX_PA25H_AC_CMP3                          (7L)        
#define PINMUX_PA25H_AC_CMP3                       ((PIN_PA25H_AC_CMP3 << 16) | MUX_PA25H_AC_CMP3)
#define PORT_PA25H_AC_CMP3                         ((1UL) << 25)

#define PIN_PB31H_AC_CMP3                          (63L)        
#define MUX_PB31H_AC_CMP3                          (7L)        
#define PINMUX_PB31H_AC_CMP3                       ((PIN_PB31H_AC_CMP3 << 16) | MUX_PB31H_AC_CMP3)
#define PORT_PB31H_AC_CMP3                         ((1UL) << 31)

/* ========== PORT definition for ADC0 peripheral ========== */
#define PIN_PA02B_ADC0_AIN0                        (2L)         
#define MUX_PA02B_ADC0_AIN0                        (1L)        
#define PINMUX_PA02B_ADC0_AIN0                     ((PIN_PA02B_ADC0_AIN0 << 16) | MUX_PA02B_ADC0_AIN0)
#define PORT_PA02B_ADC0_AIN0                       ((1UL) << 2)

#define PIN_PA03B_ADC0_AIN1                        (3L)         
#define MUX_PA03B_ADC0_AIN1                        (1L)        
#define PINMUX_PA03B_ADC0_AIN1                     ((PIN_PA03B_ADC0_AIN1 << 16) | MUX_PA03B_ADC0_AIN1)
#define PORT_PA03B_ADC0_AIN1                       ((1UL) << 3)

