bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21n/include_mcc/pio/samc21n17a.h
#define PIN_PA17H_GCLK_IO3                         (17L)        
#define MUX_PA17H_GCLK_IO3                         (7L)        
#define PINMUX_PA17H_GCLK_IO3                      ((PIN_PA17H_GCLK_IO3 << 16) | MUX_PA17H_GCLK_IO3)
#define PORT_PA17H_GCLK_IO3                        ((1UL) << 17)

#define PIN_PB17H_GCLK_IO3                         (49L)        
#define MUX_PB17H_GCLK_IO3                         (7L)        
#define PINMUX_PB17H_GCLK_IO3                      ((PIN_PB17H_GCLK_IO3 << 16) | MUX_PB17H_GCLK_IO3)
#define PORT_PB17H_GCLK_IO3                        ((1UL) << 17)

#define PIN_PA10H_GCLK_IO4                         (10L)        
#define MUX_PA10H_GCLK_IO4                         (7L)        
#define PINMUX_PA10H_GCLK_IO4                      ((PIN_PA10H_GCLK_IO4 << 16) | MUX_PA10H_GCLK_IO4)
#define PORT_PA10H_GCLK_IO4                        ((1UL) << 10)

#define PIN_PB10H_GCLK_IO4                         (42L)        
#define MUX_PB10H_GCLK_IO4                         (7L)        
#define PINMUX_PB10H_GCLK_IO4                      ((PIN_PB10H_GCLK_IO4 << 16) | MUX_PB10H_GCLK_IO4)
#define PORT_PB10H_GCLK_IO4                        ((1UL) << 10)

#define PIN_PB18H_GCLK_IO4                         (50L)        
#define MUX_PB18H_GCLK_IO4                         (7L)        
#define PINMUX_PB18H_GCLK_IO4                      ((PIN_PB18H_GCLK_IO4 << 16) | MUX_PB18H_GCLK_IO4)
#define PORT_PB18H_GCLK_IO4                        ((1UL) << 18)

#define PIN_PA20H_GCLK_IO4                         (20L)        
#define MUX_PA20H_GCLK_IO4                         (7L)        
#define PINMUX_PA20H_GCLK_IO4                      ((PIN_PA20H_GCLK_IO4 << 16) | MUX_PA20H_GCLK_IO4)
#define PORT_PA20H_GCLK_IO4                        ((1UL) << 20)

#define PIN_PA11H_GCLK_IO5                         (11L)        
#define MUX_PA11H_GCLK_IO5                         (7L)        
#define PINMUX_PA11H_GCLK_IO5                      ((PIN_PA11H_GCLK_IO5 << 16) | MUX_PA11H_GCLK_IO5)
#define PORT_PA11H_GCLK_IO5                        ((1UL) << 11)

#define PIN_PA21H_GCLK_IO5                         (21L)        
#define MUX_PA21H_GCLK_IO5                         (7L)        
#define PINMUX_PA21H_GCLK_IO5                      ((PIN_PA21H_GCLK_IO5 << 16) | MUX_PA21H_GCLK_IO5)
#define PORT_PA21H_GCLK_IO5                        ((1UL) << 21)

#define PIN_PB11H_GCLK_IO5                         (43L)        
#define MUX_PB11H_GCLK_IO5                         (7L)        
#define PINMUX_PB11H_GCLK_IO5                      ((PIN_PB11H_GCLK_IO5 << 16) | MUX_PB11H_GCLK_IO5)
#define PORT_PB11H_GCLK_IO5                        ((1UL) << 11)

#define PIN_PB19H_GCLK_IO5                         (51L)        
#define MUX_PB19H_GCLK_IO5                         (7L)        
#define PINMUX_PB19H_GCLK_IO5                      ((PIN_PB19H_GCLK_IO5 << 16) | MUX_PB19H_GCLK_IO5)
#define PORT_PB19H_GCLK_IO5                        ((1UL) << 19)

#define PIN_PA22H_GCLK_IO6                         (22L)        
#define MUX_PA22H_GCLK_IO6                         (7L)        
#define PINMUX_PA22H_GCLK_IO6                      ((PIN_PA22H_GCLK_IO6 << 16) | MUX_PA22H_GCLK_IO6)
#define PORT_PA22H_GCLK_IO6                        ((1UL) << 22)

#define PIN_PB12H_GCLK_IO6                         (44L)        
#define MUX_PB12H_GCLK_IO6                         (7L)        
#define PINMUX_PB12H_GCLK_IO6                      ((PIN_PB12H_GCLK_IO6 << 16) | MUX_PB12H_GCLK_IO6)
#define PORT_PB12H_GCLK_IO6                        ((1UL) << 12)

#define PIN_PB20H_GCLK_IO6                         (52L)        
#define MUX_PB20H_GCLK_IO6                         (7L)        
#define PINMUX_PB20H_GCLK_IO6                      ((PIN_PB20H_GCLK_IO6 << 16) | MUX_PB20H_GCLK_IO6)
#define PORT_PB20H_GCLK_IO6                        ((1UL) << 20)

#define PIN_PB13H_GCLK_IO7                         (45L)        
#define MUX_PB13H_GCLK_IO7                         (7L)        
#define PINMUX_PB13H_GCLK_IO7                      ((PIN_PB13H_GCLK_IO7 << 16) | MUX_PB13H_GCLK_IO7)
#define PORT_PB13H_GCLK_IO7                        ((1UL) << 13)

#define PIN_PA23H_GCLK_IO7                         (23L)        
#define MUX_PA23H_GCLK_IO7                         (7L)        
#define PINMUX_PA23H_GCLK_IO7                      ((PIN_PA23H_GCLK_IO7 << 16) | MUX_PA23H_GCLK_IO7)
#define PORT_PA23H_GCLK_IO7                        ((1UL) << 23)

#define PIN_PB21H_GCLK_IO7                         (53L)        
#define MUX_PB21H_GCLK_IO7                         (7L)        
#define PINMUX_PB21H_GCLK_IO7                      ((PIN_PB21H_GCLK_IO7 << 16) | MUX_PB21H_GCLK_IO7)
#define PORT_PB21H_GCLK_IO7                        ((1UL) << 21)

/* ========== PORT definition for PTC peripheral ========== */
#define PIN_PA08B_PTC_X0                           (8L)         
#define MUX_PA08B_PTC_X0                           (1L)        
#define PINMUX_PA08B_PTC_X0                        ((PIN_PA08B_PTC_X0 << 16) | MUX_PA08B_PTC_X0)
#define PORT_PA08B_PTC_X0                          ((1UL) << 8)

#define PIN_PA09B_PTC_X1                           (9L)         
#define MUX_PA09B_PTC_X1                           (1L)        
#define PINMUX_PA09B_PTC_X1                        ((PIN_PA09B_PTC_X1 << 16) | MUX_PA09B_PTC_X1)
#define PORT_PA09B_PTC_X1                          ((1UL) << 9)

#define PIN_PA10B_PTC_X2                           (10L)        
#define MUX_PA10B_PTC_X2                           (1L)        
#define PINMUX_PA10B_PTC_X2                        ((PIN_PA10B_PTC_X2 << 16) | MUX_PA10B_PTC_X2)
#define PORT_PA10B_PTC_X2                          ((1UL) << 10)

#define PIN_PA11B_PTC_X3                           (11L)        
#define MUX_PA11B_PTC_X3                           (1L)        
#define PINMUX_PA11B_PTC_X3                        ((PIN_PA11B_PTC_X3 << 16) | MUX_PA11B_PTC_X3)
#define PORT_PA11B_PTC_X3                          ((1UL) << 11)

#define PIN_PA16B_PTC_X4                           (16L)        
#define MUX_PA16B_PTC_X4                           (1L)        
#define PINMUX_PA16B_PTC_X4                        ((PIN_PA16B_PTC_X4 << 16) | MUX_PA16B_PTC_X4)
#define PORT_PA16B_PTC_X4                          ((1UL) << 16)

#define PIN_PA17B_PTC_X5                           (17L)        
#define MUX_PA17B_PTC_X5                           (1L)        
#define PINMUX_PA17B_PTC_X5                        ((PIN_PA17B_PTC_X5 << 16) | MUX_PA17B_PTC_X5)
#define PORT_PA17B_PTC_X5                          ((1UL) << 17)

#define PIN_PA18B_PTC_X6                           (18L)        
#define MUX_PA18B_PTC_X6                           (1L)        
#define PINMUX_PA18B_PTC_X6                        ((PIN_PA18B_PTC_X6 << 16) | MUX_PA18B_PTC_X6)
#define PORT_PA18B_PTC_X6                          ((1UL) << 18)

#define PIN_PA19B_PTC_X7                           (19L)        
#define MUX_PA19B_PTC_X7                           (1L)        
#define PINMUX_PA19B_PTC_X7                        ((PIN_PA19B_PTC_X7 << 16) | MUX_PA19B_PTC_X7)
#define PORT_PA19B_PTC_X7                          ((1UL) << 19)

#define PIN_PA20B_PTC_X8                           (20L)        
#define MUX_PA20B_PTC_X8                           (1L)        
#define PINMUX_PA20B_PTC_X8                        ((PIN_PA20B_PTC_X8 << 16) | MUX_PA20B_PTC_X8)
#define PORT_PA20B_PTC_X8                          ((1UL) << 20)

