bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21n/include_mcc/pio/samc21n17a.h
#define PIN_PB12B_PTC_Y28                          (44L)        
#define MUX_PB12B_PTC_Y28                          (1L)        
#define PINMUX_PB12B_PTC_Y28                       ((PIN_PB12B_PTC_Y28 << 16) | MUX_PB12B_PTC_Y28)
#define PORT_PB12B_PTC_Y28                         ((1UL) << 12)

#define PIN_PB13B_PTC_Y29                          (45L)        
#define MUX_PB13B_PTC_Y29                          (1L)        
#define PINMUX_PB13B_PTC_Y29                       ((PIN_PB13B_PTC_Y29 << 16) | MUX_PB13B_PTC_Y29)
#define PORT_PB13B_PTC_Y29                         ((1UL) << 13)

#define PIN_PB14B_PTC_Y30                          (46L)        
#define MUX_PB14B_PTC_Y30                          (1L)        
#define PINMUX_PB14B_PTC_Y30                       ((PIN_PB14B_PTC_Y30 << 16) | MUX_PB14B_PTC_Y30)
#define PORT_PB14B_PTC_Y30                         ((1UL) << 14)

#define PIN_PB15B_PTC_Y31                          (47L)        
#define MUX_PB15B_PTC_Y31                          (1L)        
#define PINMUX_PB15B_PTC_Y31                       ((PIN_PB15B_PTC_Y31 << 16) | MUX_PB15B_PTC_Y31)
#define PORT_PB15B_PTC_Y31                         ((1UL) << 15)

/* ========== PORT definition for RSTC peripheral ========== */
#define PIN_PA00A_RSTC_EXTWAKE0                    (0L)         
#define MUX_PA00A_RSTC_EXTWAKE0                    (0L)        
#define PINMUX_PA00A_RSTC_EXTWAKE0                 ((PIN_PA00A_RSTC_EXTWAKE0 << 16) | MUX_PA00A_RSTC_EXTWAKE0)
#define PORT_PA00A_RSTC_EXTWAKE0                   ((1UL) << 0)

#define PIN_PA01A_RSTC_EXTWAKE1                    (1L)         
#define MUX_PA01A_RSTC_EXTWAKE1                    (0L)        
#define PINMUX_PA01A_RSTC_EXTWAKE1                 ((PIN_PA01A_RSTC_EXTWAKE1 << 16) | MUX_PA01A_RSTC_EXTWAKE1)
#define PORT_PA01A_RSTC_EXTWAKE1                   ((1UL) << 1)

#define PIN_PA02A_RSTC_EXTWAKE2                    (2L)         
#define MUX_PA02A_RSTC_EXTWAKE2                    (0L)        
#define PINMUX_PA02A_RSTC_EXTWAKE2                 ((PIN_PA02A_RSTC_EXTWAKE2 << 16) | MUX_PA02A_RSTC_EXTWAKE2)
#define PORT_PA02A_RSTC_EXTWAKE2                   ((1UL) << 2)

#define PIN_PA03A_RSTC_EXTWAKE3                    (3L)         
#define MUX_PA03A_RSTC_EXTWAKE3                    (0L)        
#define PINMUX_PA03A_RSTC_EXTWAKE3                 ((PIN_PA03A_RSTC_EXTWAKE3 << 16) | MUX_PA03A_RSTC_EXTWAKE3)
#define PORT_PA03A_RSTC_EXTWAKE3                   ((1UL) << 3)

#define PIN_PA04A_RSTC_EXTWAKE4                    (4L)         
#define MUX_PA04A_RSTC_EXTWAKE4                    (0L)        
#define PINMUX_PA04A_RSTC_EXTWAKE4                 ((PIN_PA04A_RSTC_EXTWAKE4 << 16) | MUX_PA04A_RSTC_EXTWAKE4)
#define PORT_PA04A_RSTC_EXTWAKE4                   ((1UL) << 4)

#define PIN_PA05A_RSTC_EXTWAKE5                    (5L)         
#define MUX_PA05A_RSTC_EXTWAKE5                    (0L)        
#define PINMUX_PA05A_RSTC_EXTWAKE5                 ((PIN_PA05A_RSTC_EXTWAKE5 << 16) | MUX_PA05A_RSTC_EXTWAKE5)
#define PORT_PA05A_RSTC_EXTWAKE5                   ((1UL) << 5)

#define PIN_PA06A_RSTC_EXTWAKE6                    (6L)         
#define MUX_PA06A_RSTC_EXTWAKE6                    (0L)        
#define PINMUX_PA06A_RSTC_EXTWAKE6                 ((PIN_PA06A_RSTC_EXTWAKE6 << 16) | MUX_PA06A_RSTC_EXTWAKE6)
#define PORT_PA06A_RSTC_EXTWAKE6                   ((1UL) << 6)

#define PIN_PA07A_RSTC_EXTWAKE7                    (7L)         
#define MUX_PA07A_RSTC_EXTWAKE7                    (0L)        
#define PINMUX_PA07A_RSTC_EXTWAKE7                 ((PIN_PA07A_RSTC_EXTWAKE7 << 16) | MUX_PA07A_RSTC_EXTWAKE7)
#define PORT_PA07A_RSTC_EXTWAKE7                   ((1UL) << 7)

#define PIN_PA08A_RSTC_EXTWAKE8                    (8L)         
#define MUX_PA08A_RSTC_EXTWAKE8                    (0L)        
#define PINMUX_PA08A_RSTC_EXTWAKE8                 ((PIN_PA08A_RSTC_EXTWAKE8 << 16) | MUX_PA08A_RSTC_EXTWAKE8)
#define PORT_PA08A_RSTC_EXTWAKE8                   ((1UL) << 8)

#define PIN_PA09A_RSTC_EXTWAKE9                    (9L)         
#define MUX_PA09A_RSTC_EXTWAKE9                    (0L)        
#define PINMUX_PA09A_RSTC_EXTWAKE9                 ((PIN_PA09A_RSTC_EXTWAKE9 << 16) | MUX_PA09A_RSTC_EXTWAKE9)
#define PORT_PA09A_RSTC_EXTWAKE9                   ((1UL) << 9)

#define PIN_PA10A_RSTC_EXTWAKE10                   (10L)        
#define MUX_PA10A_RSTC_EXTWAKE10                   (0L)        
#define PINMUX_PA10A_RSTC_EXTWAKE10                ((PIN_PA10A_RSTC_EXTWAKE10 << 16) | MUX_PA10A_RSTC_EXTWAKE10)
#define PORT_PA10A_RSTC_EXTWAKE10                  ((1UL) << 10)

#define PIN_PA11A_RSTC_EXTWAKE11                   (11L)        
#define MUX_PA11A_RSTC_EXTWAKE11                   (0L)        
#define PINMUX_PA11A_RSTC_EXTWAKE11                ((PIN_PA11A_RSTC_EXTWAKE11 << 16) | MUX_PA11A_RSTC_EXTWAKE11)
#define PORT_PA11A_RSTC_EXTWAKE11                  ((1UL) << 11)

#define PIN_PA12A_RSTC_EXTWAKE12                   (12L)        
#define MUX_PA12A_RSTC_EXTWAKE12                   (0L)        
#define PINMUX_PA12A_RSTC_EXTWAKE12                ((PIN_PA12A_RSTC_EXTWAKE12 << 16) | MUX_PA12A_RSTC_EXTWAKE12)
#define PORT_PA12A_RSTC_EXTWAKE12                  ((1UL) << 12)

#define PIN_PA13A_RSTC_EXTWAKE13                   (13L)        
#define MUX_PA13A_RSTC_EXTWAKE13                   (0L)        
#define PINMUX_PA13A_RSTC_EXTWAKE13                ((PIN_PA13A_RSTC_EXTWAKE13 << 16) | MUX_PA13A_RSTC_EXTWAKE13)
#define PORT_PA13A_RSTC_EXTWAKE13                  ((1UL) << 13)

#define PIN_PA14A_RSTC_EXTWAKE14                   (14L)        
#define MUX_PA14A_RSTC_EXTWAKE14                   (0L)        
#define PINMUX_PA14A_RSTC_EXTWAKE14                ((PIN_PA14A_RSTC_EXTWAKE14 << 16) | MUX_PA14A_RSTC_EXTWAKE14)
#define PORT_PA14A_RSTC_EXTWAKE14                  ((1UL) << 14)

#define PIN_PA15A_RSTC_EXTWAKE15                   (15L)        
#define MUX_PA15A_RSTC_EXTWAKE15                   (0L)        
#define PINMUX_PA15A_RSTC_EXTWAKE15                ((PIN_PA15A_RSTC_EXTWAKE15 << 16) | MUX_PA15A_RSTC_EXTWAKE15)
#define PORT_PA15A_RSTC_EXTWAKE15                  ((1UL) << 15)

/* ========== PORT definition for SDADC peripheral ========== */
#define PIN_PA06B_SDADC_INN0                       (6L)         
#define MUX_PA06B_SDADC_INN0                       (1L)        
#define PINMUX_PA06B_SDADC_INN0                    ((PIN_PA06B_SDADC_INN0 << 16) | MUX_PA06B_SDADC_INN0)
#define PORT_PA06B_SDADC_INN0                      ((1UL) << 6)

#define PIN_PB08B_SDADC_INN1                       (40L)        
#define MUX_PB08B_SDADC_INN1                       (1L)        
#define PINMUX_PB08B_SDADC_INN1                    ((PIN_PB08B_SDADC_INN1 << 16) | MUX_PB08B_SDADC_INN1)
#define PORT_PB08B_SDADC_INN1                      ((1UL) << 8)

#define PIN_PB06B_SDADC_INN2                       (38L)        
#define MUX_PB06B_SDADC_INN2                       (1L)        
#define PINMUX_PB06B_SDADC_INN2                    ((PIN_PB06B_SDADC_INN2 << 16) | MUX_PB06B_SDADC_INN2)
#define PORT_PB06B_SDADC_INN2                      ((1UL) << 6)

#define PIN_PA07B_SDADC_INP0                       (7L)         
#define MUX_PA07B_SDADC_INP0                       (1L)        
#define PINMUX_PA07B_SDADC_INP0                    ((PIN_PA07B_SDADC_INP0 << 16) | MUX_PA07B_SDADC_INP0)
#define PORT_PA07B_SDADC_INP0                      ((1UL) << 7)

