bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21n/include_mcc/pio/samc21n17a.h
#define PIN_PB19C_SERCOM5_PAD3                     (51L)        
#define MUX_PB19C_SERCOM5_PAD3                     (2L)        
#define PINMUX_PB19C_SERCOM5_PAD3                  ((PIN_PB19C_SERCOM5_PAD3 << 16) | MUX_PB19C_SERCOM5_PAD3)
#define PORT_PB19C_SERCOM5_PAD3                    ((1UL) << 19)

/* ========== PORT definition for SERCOM6 peripheral ========== */
#define PIN_PC06C_SERCOM6_PAD0                     (70L)        
#define MUX_PC06C_SERCOM6_PAD0                     (2L)        
#define PINMUX_PC06C_SERCOM6_PAD0                  ((PIN_PC06C_SERCOM6_PAD0 << 16) | MUX_PC06C_SERCOM6_PAD0)
#define PORT_PC06C_SERCOM6_PAD0                    ((1UL) << 6)

#define PIN_PC16C_SERCOM6_PAD0                     (80L)        
#define MUX_PC16C_SERCOM6_PAD0                     (2L)        
#define PINMUX_PC16C_SERCOM6_PAD0                  ((PIN_PC16C_SERCOM6_PAD0 << 16) | MUX_PC16C_SERCOM6_PAD0)
#define PORT_PC16C_SERCOM6_PAD0                    ((1UL) << 16)

#define PIN_PC08C_SERCOM6_PAD0                     (72L)        
#define MUX_PC08C_SERCOM6_PAD0                     (2L)        
#define PINMUX_PC08C_SERCOM6_PAD0                  ((PIN_PC08C_SERCOM6_PAD0 << 16) | MUX_PC08C_SERCOM6_PAD0)
#define PORT_PC08C_SERCOM6_PAD0                    ((1UL) << 8)

#define PIN_PC07C_SERCOM6_PAD1                     (71L)        
#define MUX_PC07C_SERCOM6_PAD1                     (2L)        
#define PINMUX_PC07C_SERCOM6_PAD1                  ((PIN_PC07C_SERCOM6_PAD1 << 16) | MUX_PC07C_SERCOM6_PAD1)
#define PORT_PC07C_SERCOM6_PAD1                    ((1UL) << 7)

#define PIN_PC17C_SERCOM6_PAD1                     (81L)        
#define MUX_PC17C_SERCOM6_PAD1                     (2L)        
#define PINMUX_PC17C_SERCOM6_PAD1                  ((PIN_PC17C_SERCOM6_PAD1 << 16) | MUX_PC17C_SERCOM6_PAD1)
#define PORT_PC17C_SERCOM6_PAD1                    ((1UL) << 17)

#define PIN_PC09C_SERCOM6_PAD1                     (73L)        
#define MUX_PC09C_SERCOM6_PAD1                     (2L)        
#define PINMUX_PC09C_SERCOM6_PAD1                  ((PIN_PC09C_SERCOM6_PAD1 << 16) | MUX_PC09C_SERCOM6_PAD1)
#define PORT_PC09C_SERCOM6_PAD1                    ((1UL) << 9)

#define PIN_PC18C_SERCOM6_PAD2                     (82L)        
#define MUX_PC18C_SERCOM6_PAD2                     (2L)        
#define PINMUX_PC18C_SERCOM6_PAD2                  ((PIN_PC18C_SERCOM6_PAD2 << 16) | MUX_PC18C_SERCOM6_PAD2)
#define PORT_PC18C_SERCOM6_PAD2                    ((1UL) << 18)

#define PIN_PC10C_SERCOM6_PAD2                     (74L)        
#define MUX_PC10C_SERCOM6_PAD2                     (2L)        
#define PINMUX_PC10C_SERCOM6_PAD2                  ((PIN_PC10C_SERCOM6_PAD2 << 16) | MUX_PC10C_SERCOM6_PAD2)
#define PORT_PC10C_SERCOM6_PAD2                    ((1UL) << 10)

#define PIN_PC05C_SERCOM6_PAD3                     (69L)        
#define MUX_PC05C_SERCOM6_PAD3                     (2L)        
#define PINMUX_PC05C_SERCOM6_PAD3                  ((PIN_PC05C_SERCOM6_PAD3 << 16) | MUX_PC05C_SERCOM6_PAD3)
#define PORT_PC05C_SERCOM6_PAD3                    ((1UL) << 5)

#define PIN_PC11C_SERCOM6_PAD3                     (75L)        
#define MUX_PC11C_SERCOM6_PAD3                     (2L)        
#define PINMUX_PC11C_SERCOM6_PAD3                  ((PIN_PC11C_SERCOM6_PAD3 << 16) | MUX_PC11C_SERCOM6_PAD3)
#define PORT_PC11C_SERCOM6_PAD3                    ((1UL) << 11)

#define PIN_PC19C_SERCOM6_PAD3                     (83L)        
#define MUX_PC19C_SERCOM6_PAD3                     (2L)        
#define PINMUX_PC19C_SERCOM6_PAD3                  ((PIN_PC19C_SERCOM6_PAD3 << 16) | MUX_PC19C_SERCOM6_PAD3)
#define PORT_PC19C_SERCOM6_PAD3                    ((1UL) << 19)

/* ========== PORT definition for SERCOM7 peripheral ========== */
#define PIN_PC08D_SERCOM7_PAD0                     (72L)        
#define MUX_PC08D_SERCOM7_PAD0                     (3L)        
#define PINMUX_PC08D_SERCOM7_PAD0                  ((PIN_PC08D_SERCOM7_PAD0 << 16) | MUX_PC08D_SERCOM7_PAD0)
#define PORT_PC08D_SERCOM7_PAD0                    ((1UL) << 8)

#define PIN_PC03C_SERCOM7_PAD0                     (67L)        
#define MUX_PC03C_SERCOM7_PAD0                     (2L)        
#define PINMUX_PC03C_SERCOM7_PAD0                  ((PIN_PC03C_SERCOM7_PAD0 << 16) | MUX_PC03C_SERCOM7_PAD0)
#define PORT_PC03C_SERCOM7_PAD0                    ((1UL) << 3)

#define PIN_PC12C_SERCOM7_PAD0                     (76L)        
#define MUX_PC12C_SERCOM7_PAD0                     (2L)        
#define PINMUX_PC12C_SERCOM7_PAD0                  ((PIN_PC12C_SERCOM7_PAD0 << 16) | MUX_PC12C_SERCOM7_PAD0)
#define PORT_PC12C_SERCOM7_PAD0                    ((1UL) << 12)

#define PIN_PC09D_SERCOM7_PAD1                     (73L)        
#define MUX_PC09D_SERCOM7_PAD1                     (3L)        
#define PINMUX_PC09D_SERCOM7_PAD1                  ((PIN_PC09D_SERCOM7_PAD1 << 16) | MUX_PC09D_SERCOM7_PAD1)
#define PORT_PC09D_SERCOM7_PAD1                    ((1UL) << 9)

#define PIN_PB06C_SERCOM7_PAD1                     (38L)        
#define MUX_PB06C_SERCOM7_PAD1                     (2L)        
#define PINMUX_PB06C_SERCOM7_PAD1                  ((PIN_PB06C_SERCOM7_PAD1 << 16) | MUX_PB06C_SERCOM7_PAD1)
#define PORT_PB06C_SERCOM7_PAD1                    ((1UL) << 6)

#define PIN_PC13C_SERCOM7_PAD1                     (77L)        
#define MUX_PC13C_SERCOM7_PAD1                     (2L)        
#define PINMUX_PC13C_SERCOM7_PAD1                  ((PIN_PC13C_SERCOM7_PAD1 << 16) | MUX_PC13C_SERCOM7_PAD1)
#define PORT_PC13C_SERCOM7_PAD1                    ((1UL) << 13)

#define PIN_PB07D_SERCOM7_PAD2                     (39L)        
#define MUX_PB07D_SERCOM7_PAD2                     (3L)        
#define PINMUX_PB07D_SERCOM7_PAD2                  ((PIN_PB07D_SERCOM7_PAD2 << 16) | MUX_PB07D_SERCOM7_PAD2)
#define PORT_PB07D_SERCOM7_PAD2                    ((1UL) << 7)

#define PIN_PC10D_SERCOM7_PAD2                     (74L)        
#define MUX_PC10D_SERCOM7_PAD2                     (3L)        
#define PINMUX_PC10D_SERCOM7_PAD2                  ((PIN_PC10D_SERCOM7_PAD2 << 16) | MUX_PC10D_SERCOM7_PAD2)
#define PORT_PC10D_SERCOM7_PAD2                    ((1UL) << 10)

#define PIN_PB08C_SERCOM7_PAD2                     (40L)        
#define MUX_PB08C_SERCOM7_PAD2                     (2L)        
#define PINMUX_PB08C_SERCOM7_PAD2                  ((PIN_PB08C_SERCOM7_PAD2 << 16) | MUX_PB08C_SERCOM7_PAD2)
#define PORT_PB08C_SERCOM7_PAD2                    ((1UL) << 8)

