bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21n/include_mcc/pio/samc21n17a.h
#define PIN_PC14C_SERCOM7_PAD2                     (78L)        
#define MUX_PC14C_SERCOM7_PAD2                     (2L)        
#define PINMUX_PC14C_SERCOM7_PAD2                  ((PIN_PC14C_SERCOM7_PAD2 << 16) | MUX_PC14C_SERCOM7_PAD2)
#define PORT_PC14C_SERCOM7_PAD2                    ((1UL) << 14)

#define PIN_PB08D_SERCOM7_PAD3                     (40L)        
#define MUX_PB08D_SERCOM7_PAD3                     (3L)        
#define PINMUX_PB08D_SERCOM7_PAD3                  ((PIN_PB08D_SERCOM7_PAD3 << 16) | MUX_PB08D_SERCOM7_PAD3)
#define PORT_PB08D_SERCOM7_PAD3                    ((1UL) << 8)

#define PIN_PC11D_SERCOM7_PAD3                     (75L)        
#define MUX_PC11D_SERCOM7_PAD3                     (3L)        
#define PINMUX_PC11D_SERCOM7_PAD3                  ((PIN_PC11D_SERCOM7_PAD3 << 16) | MUX_PC11D_SERCOM7_PAD3)
#define PORT_PC11D_SERCOM7_PAD3                    ((1UL) << 11)

#define PIN_PB07C_SERCOM7_PAD3                     (39L)        
#define MUX_PB07C_SERCOM7_PAD3                     (2L)        
#define PINMUX_PB07C_SERCOM7_PAD3                  ((PIN_PB07C_SERCOM7_PAD3 << 16) | MUX_PB07C_SERCOM7_PAD3)
#define PORT_PB07C_SERCOM7_PAD3                    ((1UL) << 7)

#define PIN_PC15C_SERCOM7_PAD3                     (79L)        
#define MUX_PC15C_SERCOM7_PAD3                     (2L)        
#define PINMUX_PC15C_SERCOM7_PAD3                  ((PIN_PC15C_SERCOM7_PAD3 << 16) | MUX_PC15C_SERCOM7_PAD3)
#define PORT_PC15C_SERCOM7_PAD3                    ((1UL) << 15)

/* ========== PORT definition for TC0 peripheral ========== */
#define PIN_PA08E_TC0_WO0                          (8L)         
#define MUX_PA08E_TC0_WO0                          (4L)        
#define PINMUX_PA08E_TC0_WO0                       ((PIN_PA08E_TC0_WO0 << 16) | MUX_PA08E_TC0_WO0)
#define PORT_PA08E_TC0_WO0                         ((1UL) << 8)

#define PIN_PA04E_TC0_WO0                          (4L)         
#define MUX_PA04E_TC0_WO0                          (4L)        
#define PINMUX_PA04E_TC0_WO0                       ((PIN_PA04E_TC0_WO0 << 16) | MUX_PA04E_TC0_WO0)
#define PORT_PA04E_TC0_WO0                         ((1UL) << 4)

#define PIN_PB30E_TC0_WO0                          (62L)        
#define MUX_PB30E_TC0_WO0                          (4L)        
#define PINMUX_PB30E_TC0_WO0                       ((PIN_PB30E_TC0_WO0 << 16) | MUX_PB30E_TC0_WO0)
#define PORT_PB30E_TC0_WO0                         ((1UL) << 30)

#define PIN_PA09E_TC0_WO1                          (9L)         
#define MUX_PA09E_TC0_WO1                          (4L)        
#define PINMUX_PA09E_TC0_WO1                       ((PIN_PA09E_TC0_WO1 << 16) | MUX_PA09E_TC0_WO1)
#define PORT_PA09E_TC0_WO1                         ((1UL) << 9)

#define PIN_PA05E_TC0_WO1                          (5L)         
#define MUX_PA05E_TC0_WO1                          (4L)        
#define PINMUX_PA05E_TC0_WO1                       ((PIN_PA05E_TC0_WO1 << 16) | MUX_PA05E_TC0_WO1)
#define PORT_PA05E_TC0_WO1                         ((1UL) << 5)

#define PIN_PB31E_TC0_WO1                          (63L)        
#define MUX_PB31E_TC0_WO1                          (4L)        
#define PINMUX_PB31E_TC0_WO1                       ((PIN_PB31E_TC0_WO1 << 16) | MUX_PB31E_TC0_WO1)
#define PORT_PB31E_TC0_WO1                         ((1UL) << 31)

/* ========== PORT definition for TC1 peripheral ========== */
#define PIN_PA10E_TC1_WO0                          (10L)        
#define MUX_PA10E_TC1_WO0                          (4L)        
#define PINMUX_PA10E_TC1_WO0                       ((PIN_PA10E_TC1_WO0 << 16) | MUX_PA10E_TC1_WO0)
#define PORT_PA10E_TC1_WO0                         ((1UL) << 10)

#define PIN_PA06E_TC1_WO0                          (6L)         
#define MUX_PA06E_TC1_WO0                          (4L)        
#define PINMUX_PA06E_TC1_WO0                       ((PIN_PA06E_TC1_WO0 << 16) | MUX_PA06E_TC1_WO0)
#define PORT_PA06E_TC1_WO0                         ((1UL) << 6)

#define PIN_PA30E_TC1_WO0                          (30L)        
#define MUX_PA30E_TC1_WO0                          (4L)        
#define PINMUX_PA30E_TC1_WO0                       ((PIN_PA30E_TC1_WO0 << 16) | MUX_PA30E_TC1_WO0)
#define PORT_PA30E_TC1_WO0                         ((1UL) << 30)

#define PIN_PA11E_TC1_WO1                          (11L)        
#define MUX_PA11E_TC1_WO1                          (4L)        
#define PINMUX_PA11E_TC1_WO1                       ((PIN_PA11E_TC1_WO1 << 16) | MUX_PA11E_TC1_WO1)
#define PORT_PA11E_TC1_WO1                         ((1UL) << 11)

#define PIN_PA07E_TC1_WO1                          (7L)         
#define MUX_PA07E_TC1_WO1                          (4L)        
#define PINMUX_PA07E_TC1_WO1                       ((PIN_PA07E_TC1_WO1 << 16) | MUX_PA07E_TC1_WO1)
#define PORT_PA07E_TC1_WO1                         ((1UL) << 7)

#define PIN_PA31E_TC1_WO1                          (31L)        
#define MUX_PA31E_TC1_WO1                          (4L)        
#define PINMUX_PA31E_TC1_WO1                       ((PIN_PA31E_TC1_WO1 << 16) | MUX_PA31E_TC1_WO1)
#define PORT_PA31E_TC1_WO1                         ((1UL) << 31)

/* ========== PORT definition for TC2 peripheral ========== */
#define PIN_PA12E_TC2_WO0                          (12L)        
#define MUX_PA12E_TC2_WO0                          (4L)        
#define PINMUX_PA12E_TC2_WO0                       ((PIN_PA12E_TC2_WO0 << 16) | MUX_PA12E_TC2_WO0)
#define PORT_PA12E_TC2_WO0                         ((1UL) << 12)

#define PIN_PA16E_TC2_WO0                          (16L)        
#define MUX_PA16E_TC2_WO0                          (4L)        
#define PINMUX_PA16E_TC2_WO0                       ((PIN_PA16E_TC2_WO0 << 16) | MUX_PA16E_TC2_WO0)
#define PORT_PA16E_TC2_WO0                         ((1UL) << 16)

#define PIN_PA00E_TC2_WO0                          (0L)         
#define MUX_PA00E_TC2_WO0                          (4L)        
#define PINMUX_PA00E_TC2_WO0                       ((PIN_PA00E_TC2_WO0 << 16) | MUX_PA00E_TC2_WO0)
#define PORT_PA00E_TC2_WO0                         ((1UL) << 0)

#define PIN_PA01E_TC2_WO1                          (1L)         
#define MUX_PA01E_TC2_WO1                          (4L)        
#define PINMUX_PA01E_TC2_WO1                       ((PIN_PA01E_TC2_WO1 << 16) | MUX_PA01E_TC2_WO1)
#define PORT_PA01E_TC2_WO1                         ((1UL) << 1)

#define PIN_PA13E_TC2_WO1                          (13L)        
#define MUX_PA13E_TC2_WO1                          (4L)        
#define PINMUX_PA13E_TC2_WO1                       ((PIN_PA13E_TC2_WO1 << 16) | MUX_PA13E_TC2_WO1)
#define PORT_PA13E_TC2_WO1                         ((1UL) << 13)

#define PIN_PA17E_TC2_WO1                          (17L)        
#define MUX_PA17E_TC2_WO1                          (4L)        
#define PINMUX_PA17E_TC2_WO1                       ((PIN_PA17E_TC2_WO1 << 16) | MUX_PA17E_TC2_WO1)
#define PORT_PA17E_TC2_WO1                         ((1UL) << 17)

/* ========== PORT definition for TC3 peripheral ========== */
#define PIN_PA18E_TC3_WO0                          (18L)        
#define MUX_PA18E_TC3_WO0                          (4L)        
#define PINMUX_PA18E_TC3_WO0                       ((PIN_PA18E_TC3_WO0 << 16) | MUX_PA18E_TC3_WO0)
#define PORT_PA18E_TC3_WO0                         ((1UL) << 18)

#define PIN_PA14E_TC3_WO0                          (14L)        
#define MUX_PA14E_TC3_WO0                          (4L)        
#define PINMUX_PA14E_TC3_WO0                       ((PIN_PA14E_TC3_WO0 << 16) | MUX_PA14E_TC3_WO0)
#define PORT_PA14E_TC3_WO0                         ((1UL) << 14)

#define PIN_PA15E_TC3_WO1                          (15L)        
#define MUX_PA15E_TC3_WO1                          (4L)        
#define PINMUX_PA15E_TC3_WO1                       ((PIN_PA15E_TC3_WO1 << 16) | MUX_PA15E_TC3_WO1)
#define PORT_PA15E_TC3_WO1                         ((1UL) << 15)

#define PIN_PA19E_TC3_WO1                          (19L)        
#define MUX_PA19E_TC3_WO1                          (4L)        
#define PINMUX_PA19E_TC3_WO1                       ((PIN_PA19E_TC3_WO1 << 16) | MUX_PA19E_TC3_WO1)
#define PORT_PA19E_TC3_WO1                         ((1UL) << 19)

/* ========== PORT definition for TC4 peripheral ========== */
#define PIN_PB12E_TC4_WO0                          (44L)        
#define MUX_PB12E_TC4_WO0                          (4L)        
#define PINMUX_PB12E_TC4_WO0                       ((PIN_PB12E_TC4_WO0 << 16) | MUX_PB12E_TC4_WO0)
#define PORT_PB12E_TC4_WO0                         ((1UL) << 12)

#define PIN_PA22E_TC4_WO0                          (22L)        
#define MUX_PA22E_TC4_WO0                          (4L)        
#define PINMUX_PA22E_TC4_WO0                       ((PIN_PA22E_TC4_WO0 << 16) | MUX_PA22E_TC4_WO0)
#define PORT_PA22E_TC4_WO0                         ((1UL) << 22)

#define PIN_PB08E_TC4_WO0                          (40L)        
#define MUX_PB08E_TC4_WO0                          (4L)        
#define PINMUX_PB08E_TC4_WO0                       ((PIN_PB08E_TC4_WO0 << 16) | MUX_PB08E_TC4_WO0)
#define PORT_PB08E_TC4_WO0                         ((1UL) << 8)

#define PIN_PB09E_TC4_WO1                          (41L)        
#define MUX_PB09E_TC4_WO1                          (4L)        
#define PINMUX_PB09E_TC4_WO1                       ((PIN_PB09E_TC4_WO1 << 16) | MUX_PB09E_TC4_WO1)
#define PORT_PB09E_TC4_WO1                         ((1UL) << 9)

#define PIN_PA23E_TC4_WO1                          (23L)        
#define MUX_PA23E_TC4_WO1                          (4L)        
#define PINMUX_PA23E_TC4_WO1                       ((PIN_PA23E_TC4_WO1 << 16) | MUX_PA23E_TC4_WO1)
#define PORT_PA23E_TC4_WO1                         ((1UL) << 23)

#define PIN_PB13E_TC4_WO1                          (45L)        
#define MUX_PB13E_TC4_WO1                          (4L)        
#define PINMUX_PB13E_TC4_WO1                       ((PIN_PB13E_TC4_WO1 << 16) | MUX_PB13E_TC4_WO1)
#define PORT_PB13E_TC4_WO1                         ((1UL) << 13)

