bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21n/include_mcc/pio/samc21n17a.h
/* ========== PORT definition for TC5 peripheral ========== */
#define PIN_PB14E_TC5_WO0                          (46L)        
#define MUX_PB14E_TC5_WO0                          (4L)        
#define PINMUX_PB14E_TC5_WO0                       ((PIN_PB14E_TC5_WO0 << 16) | MUX_PB14E_TC5_WO0)
#define PORT_PB14E_TC5_WO0                         ((1UL) << 14)

#define PIN_PA24E_TC5_WO0                          (24L)        
#define MUX_PA24E_TC5_WO0                          (4L)        
#define PINMUX_PA24E_TC5_WO0                       ((PIN_PA24E_TC5_WO0 << 16) | MUX_PA24E_TC5_WO0)
#define PORT_PA24E_TC5_WO0                         ((1UL) << 24)

#define PIN_PB10E_TC5_WO0                          (42L)        
#define MUX_PB10E_TC5_WO0                          (4L)        
#define PINMUX_PB10E_TC5_WO0                       ((PIN_PB10E_TC5_WO0 << 16) | MUX_PB10E_TC5_WO0)
#define PORT_PB10E_TC5_WO0                         ((1UL) << 10)

#define PIN_PA25E_TC5_WO1                          (25L)        
#define MUX_PA25E_TC5_WO1                          (4L)        
#define PINMUX_PA25E_TC5_WO1                       ((PIN_PA25E_TC5_WO1 << 16) | MUX_PA25E_TC5_WO1)
#define PORT_PA25E_TC5_WO1                         ((1UL) << 25)

#define PIN_PB11E_TC5_WO1                          (43L)        
#define MUX_PB11E_TC5_WO1                          (4L)        
#define PINMUX_PB11E_TC5_WO1                       ((PIN_PB11E_TC5_WO1 << 16) | MUX_PB11E_TC5_WO1)
#define PORT_PB11E_TC5_WO1                         ((1UL) << 11)

#define PIN_PB15E_TC5_WO1                          (47L)        
#define MUX_PB15E_TC5_WO1                          (4L)        
#define PINMUX_PB15E_TC5_WO1                       ((PIN_PB15E_TC5_WO1 << 16) | MUX_PB15E_TC5_WO1)
#define PORT_PB15E_TC5_WO1                         ((1UL) << 15)

/* ========== PORT definition for TC6 peripheral ========== */
#define PIN_PB16E_TC6_WO0                          (48L)        
#define MUX_PB16E_TC6_WO0                          (4L)        
#define PINMUX_PB16E_TC6_WO0                       ((PIN_PB16E_TC6_WO0 << 16) | MUX_PB16E_TC6_WO0)
#define PORT_PB16E_TC6_WO0                         ((1UL) << 16)

#define PIN_PB02E_TC6_WO0                          (34L)        
#define MUX_PB02E_TC6_WO0                          (4L)        
#define PINMUX_PB02E_TC6_WO0                       ((PIN_PB02E_TC6_WO0 << 16) | MUX_PB02E_TC6_WO0)
#define PORT_PB02E_TC6_WO0                         ((1UL) << 2)

#define PIN_PB17E_TC6_WO1                          (49L)        
#define MUX_PB17E_TC6_WO1                          (4L)        
#define PINMUX_PB17E_TC6_WO1                       ((PIN_PB17E_TC6_WO1 << 16) | MUX_PB17E_TC6_WO1)
#define PORT_PB17E_TC6_WO1                         ((1UL) << 17)

#define PIN_PB03E_TC6_WO1                          (35L)        
#define MUX_PB03E_TC6_WO1                          (4L)        
#define PINMUX_PB03E_TC6_WO1                       ((PIN_PB03E_TC6_WO1 << 16) | MUX_PB03E_TC6_WO1)
#define PORT_PB03E_TC6_WO1                         ((1UL) << 3)

/* ========== PORT definition for TC7 peripheral ========== */
#define PIN_PB22E_TC7_WO0                          (54L)        
#define MUX_PB22E_TC7_WO0                          (4L)        
#define PINMUX_PB22E_TC7_WO0                       ((PIN_PB22E_TC7_WO0 << 16) | MUX_PB22E_TC7_WO0)
#define PORT_PB22E_TC7_WO0                         ((1UL) << 22)

#define PIN_PA20E_TC7_WO0                          (20L)        
#define MUX_PA20E_TC7_WO0                          (4L)        
#define PINMUX_PA20E_TC7_WO0                       ((PIN_PA20E_TC7_WO0 << 16) | MUX_PA20E_TC7_WO0)
#define PORT_PA20E_TC7_WO0                         ((1UL) << 20)

#define PIN_PB00E_TC7_WO0                          (32L)        
#define MUX_PB00E_TC7_WO0                          (4L)        
#define PINMUX_PB00E_TC7_WO0                       ((PIN_PB00E_TC7_WO0 << 16) | MUX_PB00E_TC7_WO0)
#define PORT_PB00E_TC7_WO0                         ((1UL) << 0)

#define PIN_PB01E_TC7_WO1                          (33L)        
#define MUX_PB01E_TC7_WO1                          (4L)        
#define PINMUX_PB01E_TC7_WO1                       ((PIN_PB01E_TC7_WO1 << 16) | MUX_PB01E_TC7_WO1)
#define PORT_PB01E_TC7_WO1                         ((1UL) << 1)

#define PIN_PA21E_TC7_WO1                          (21L)        
#define MUX_PA21E_TC7_WO1                          (4L)        
#define PINMUX_PA21E_TC7_WO1                       ((PIN_PA21E_TC7_WO1 << 16) | MUX_PA21E_TC7_WO1)
#define PORT_PA21E_TC7_WO1                         ((1UL) << 21)

#define PIN_PB23E_TC7_WO1                          (55L)        
#define MUX_PB23E_TC7_WO1                          (4L)        
#define PINMUX_PB23E_TC7_WO1                       ((PIN_PB23E_TC7_WO1 << 16) | MUX_PB23E_TC7_WO1)
#define PORT_PB23E_TC7_WO1                         ((1UL) << 23)

/* ========== PORT definition for TCC0 peripheral ========== */
#define PIN_PA08F_TCC0_WO0                         (8L)         
#define MUX_PA08F_TCC0_WO0                         (5L)        
#define PINMUX_PA08F_TCC0_WO0                      ((PIN_PA08F_TCC0_WO0 << 16) | MUX_PA08F_TCC0_WO0)
#define PORT_PA08F_TCC0_WO0                        ((1UL) << 8)

#define PIN_PA09F_TCC0_WO1                         (9L)         
#define MUX_PA09F_TCC0_WO1                         (5L)        
#define PINMUX_PA09F_TCC0_WO1                      ((PIN_PA09F_TCC0_WO1 << 16) | MUX_PA09F_TCC0_WO1)
#define PORT_PA09F_TCC0_WO1                        ((1UL) << 9)

#define PIN_PA10F_TCC0_WO2                         (10L)        
#define MUX_PA10F_TCC0_WO2                         (5L)        
#define PINMUX_PA10F_TCC0_WO2                      ((PIN_PA10F_TCC0_WO2 << 16) | MUX_PA10F_TCC0_WO2)
#define PORT_PA10F_TCC0_WO2                        ((1UL) << 10)

#define PIN_PA11F_TCC0_WO3                         (11L)        
#define MUX_PA11F_TCC0_WO3                         (5L)        
#define PINMUX_PA11F_TCC0_WO3                      ((PIN_PA11F_TCC0_WO3 << 16) | MUX_PA11F_TCC0_WO3)
#define PORT_PA11F_TCC0_WO3                        ((1UL) << 11)

