bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21n/include_mcc/pio/samc21n17a.h
#define PIN_PB10F_TCC0_WO4                         (42L)        
#define MUX_PB10F_TCC0_WO4                         (5L)        
#define PINMUX_PB10F_TCC0_WO4                      ((PIN_PB10F_TCC0_WO4 << 16) | MUX_PB10F_TCC0_WO4)
#define PORT_PB10F_TCC0_WO4                        ((1UL) << 10)

#define PIN_PB11F_TCC0_WO5                         (43L)        
#define MUX_PB11F_TCC0_WO5                         (5L)        
#define PINMUX_PB11F_TCC0_WO5                      ((PIN_PB11F_TCC0_WO5 << 16) | MUX_PB11F_TCC0_WO5)
#define PORT_PB11F_TCC0_WO5                        ((1UL) << 11)

#define PIN_PA12F_TCC0_WO6                         (12L)        
#define MUX_PA12F_TCC0_WO6                         (5L)        
#define PINMUX_PA12F_TCC0_WO6                      ((PIN_PA12F_TCC0_WO6 << 16) | MUX_PA12F_TCC0_WO6)
#define PORT_PA12F_TCC0_WO6                        ((1UL) << 12)

#define PIN_PB12F_TCC0_WO6                         (44L)        
#define MUX_PB12F_TCC0_WO6                         (5L)        
#define PINMUX_PB12F_TCC0_WO6                      ((PIN_PB12F_TCC0_WO6 << 16) | MUX_PB12F_TCC0_WO6)
#define PORT_PB12F_TCC0_WO6                        ((1UL) << 12)

#define PIN_PA13F_TCC0_WO7                         (13L)        
#define MUX_PA13F_TCC0_WO7                         (5L)        
#define PINMUX_PA13F_TCC0_WO7                      ((PIN_PA13F_TCC0_WO7 << 16) | MUX_PA13F_TCC0_WO7)
#define PORT_PA13F_TCC0_WO7                        ((1UL) << 13)

#define PIN_PB13F_TCC0_WO7                         (45L)        
#define MUX_PB13F_TCC0_WO7                         (5L)        
#define PINMUX_PB13F_TCC0_WO7                      ((PIN_PB13F_TCC0_WO7 << 16) | MUX_PB13F_TCC0_WO7)
#define PORT_PB13F_TCC0_WO7                        ((1UL) << 13)

/* ========== PORT definition for TCC1 peripheral ========== */
#define PIN_PA16F_TCC1_WO0                         (16L)        
#define MUX_PA16F_TCC1_WO0                         (5L)        
#define PINMUX_PA16F_TCC1_WO0                      ((PIN_PA16F_TCC1_WO0 << 16) | MUX_PA16F_TCC1_WO0)
#define PORT_PA16F_TCC1_WO0                        ((1UL) << 16)

#define PIN_PA22F_TCC1_WO0                         (22L)        
#define MUX_PA22F_TCC1_WO0                         (5L)        
#define PINMUX_PA22F_TCC1_WO0                      ((PIN_PA22F_TCC1_WO0 << 16) | MUX_PA22F_TCC1_WO0)
#define PORT_PA22F_TCC1_WO0                        ((1UL) << 22)

#define PIN_PA17F_TCC1_WO1                         (17L)        
#define MUX_PA17F_TCC1_WO1                         (5L)        
#define PINMUX_PA17F_TCC1_WO1                      ((PIN_PA17F_TCC1_WO1 << 16) | MUX_PA17F_TCC1_WO1)
#define PORT_PA17F_TCC1_WO1                        ((1UL) << 17)

#define PIN_PA23F_TCC1_WO1                         (23L)        
#define MUX_PA23F_TCC1_WO1                         (5L)        
#define PINMUX_PA23F_TCC1_WO1                      ((PIN_PA23F_TCC1_WO1 << 16) | MUX_PA23F_TCC1_WO1)
#define PORT_PA23F_TCC1_WO1                        ((1UL) << 23)

#define PIN_PA18F_TCC1_WO2                         (18L)        
#define MUX_PA18F_TCC1_WO2                         (5L)        
#define PINMUX_PA18F_TCC1_WO2                      ((PIN_PA18F_TCC1_WO2 << 16) | MUX_PA18F_TCC1_WO2)
#define PORT_PA18F_TCC1_WO2                        ((1UL) << 18)

#define PIN_PB22F_TCC1_WO2                         (54L)        
#define MUX_PB22F_TCC1_WO2                         (5L)        
#define PINMUX_PB22F_TCC1_WO2                      ((PIN_PB22F_TCC1_WO2 << 16) | MUX_PB22F_TCC1_WO2)
#define PORT_PB22F_TCC1_WO2                        ((1UL) << 22)

#define PIN_PA19F_TCC1_WO3                         (19L)        
#define MUX_PA19F_TCC1_WO3                         (5L)        
#define PINMUX_PA19F_TCC1_WO3                      ((PIN_PA19F_TCC1_WO3 << 16) | MUX_PA19F_TCC1_WO3)
#define PORT_PA19F_TCC1_WO3                        ((1UL) << 19)

#define PIN_PB23F_TCC1_WO3                         (55L)        
#define MUX_PB23F_TCC1_WO3                         (5L)        
#define PINMUX_PB23F_TCC1_WO3                      ((PIN_PB23F_TCC1_WO3 << 16) | MUX_PB23F_TCC1_WO3)
#define PORT_PB23F_TCC1_WO3                        ((1UL) << 23)

/* ========== PORT definition for TCC2 peripheral ========== */
#define PIN_PC03F_TCC2_WO0                         (67L)        
#define MUX_PC03F_TCC2_WO0                         (5L)        
#define PINMUX_PC03F_TCC2_WO0                      ((PIN_PC03F_TCC2_WO0 << 16) | MUX_PC03F_TCC2_WO0)
#define PORT_PC03F_TCC2_WO0                        ((1UL) << 3)

#define PIN_PA20F_TCC2_WO0                         (20L)        
#define MUX_PA20F_TCC2_WO0                         (5L)        
#define PINMUX_PA20F_TCC2_WO0                      ((PIN_PA20F_TCC2_WO0 << 16) | MUX_PA20F_TCC2_WO0)
#define PORT_PA20F_TCC2_WO0                        ((1UL) << 20)

#define PIN_PA24F_TCC2_WO0                         (24L)        
#define MUX_PA24F_TCC2_WO0                         (5L)        
#define PINMUX_PA24F_TCC2_WO0                      ((PIN_PA24F_TCC2_WO0 << 16) | MUX_PA24F_TCC2_WO0)
#define PORT_PA24F_TCC2_WO0                        ((1UL) << 24)

#define PIN_PA25F_TCC2_WO1                         (25L)        
#define MUX_PA25F_TCC2_WO1                         (5L)        
#define PINMUX_PA25F_TCC2_WO1                      ((PIN_PA25F_TCC2_WO1 << 16) | MUX_PA25F_TCC2_WO1)
#define PORT_PA25F_TCC2_WO1                        ((1UL) << 25)

#define PIN_PA21F_TCC2_WO1                         (21L)        
#define MUX_PA21F_TCC2_WO1                         (5L)        
#define PINMUX_PA21F_TCC2_WO1                      ((PIN_PA21F_TCC2_WO1 << 16) | MUX_PA21F_TCC2_WO1)
#define PORT_PA21F_TCC2_WO1                        ((1UL) << 21)

#define PIN_PC05F_TCC2_WO1                         (69L)        
#define MUX_PC05F_TCC2_WO1                         (5L)        
#define PINMUX_PC05F_TCC2_WO1                      ((PIN_PC05F_TCC2_WO1 << 16) | MUX_PC05F_TCC2_WO1)
#define PORT_PC05F_TCC2_WO1                        ((1UL) << 5)



#endif /* _SAMC21N17A_GPIO_H_ */

